nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/demo_apps/mc_pmsm/pmsm_enc/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_EMC_B1_21 (coord N1), J129[11] */
/* Routed pin properties */
#define BOARD_INITPINS_FLEXIO_21_PERIPHERAL                                GPIO7   /*!< Peripheral name */
#define BOARD_INITPINS_FLEXIO_21_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_FLEXIO_21_CHANNEL                                     21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_FLEXIO_21_GPIO                                      GPIO7   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_FLEXIO_21_INIT_GPIO_VALUE                              0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_FLEXIO_21_GPIO_PIN                                    21U   /*!< GPIO pin number */
#define BOARD_INITPINS_FLEXIO_21_GPIO_PIN_MASK                       (1U << 21U)   /*!< GPIO pin mask */

/* GPIO_EMC_B1_36 (coord N3), GPIO_EMC_B1_36 */
/* Routed pin properties */
#define BOARD_INITPINS_GREEN_LED_PERIPHERAL                                GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_GREEN_LED_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_GREEN_LED_CHANNEL                                      4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_GREEN_LED_GPIO                                      GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_GREEN_LED_INIT_GPIO_VALUE                              0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_GREEN_LED_GPIO_PIN                                     4U   /*!< GPIO pin number */
#define BOARD_INITPINS_GREEN_LED_GPIO_PIN_MASK                        (1U << 4U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_AD_25 (coord T18), U30[3] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_LPUART1_RXD_PERIPHERAL                  LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_LPUART1_RXD_SIGNAL                          RXD   /*!< Signal name */

/* GPIO_AD_24 (coord T19), U30[4] */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_LPUART1_TXD_PERIPHERAL                  LPUART1   /*!< Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_LPUART1_TXD_SIGNAL                          TXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);          /* Function assigned for the Cortex-M7F */

/* GPIO_AD_05 (coord V19), U748[2]/J1[10]/J70[1] */
/* Routed pin properties */
#define BOARD_INITUARTPINS_LPUART8_RTS_PERIPHERAL                        LPUART8   /*!< Peripheral name */
#define BOARD_INITUARTPINS_LPUART8_RTS_SIGNAL                              RTS_B   /*!< Signal name */

/* GPIO_AD_02 (coord Y19), U30[6]/J1[4]/J70[4]/U748[4] */
/* Routed pin properties */
#define BOARD_INITUARTPINS_LPUART8_TXD_PERIPHERAL                        LPUART8   /*!< Peripheral name */
#define BOARD_INITUARTPINS_LPUART8_TXD_SIGNAL                                TXD   /*!< Signal name */

/* GPIO_AD_03 (coord W25), U30[5]/J1[2]/J70[3]/U748[1] */
/* Routed pin properties */
#define BOARD_INITUARTPINS_LPUART8_RXD_PERIPHERAL                        LPUART8   /*!< Peripheral name */
#define BOARD_INITUARTPINS_LPUART8_RXD_SIGNAL                                RXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUARTPins(void);                /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_00 (coord G1), J128[1]/J52[15] */
/* Routed pin properties */
#define BOARD_INITPWM_FLEXIO_00_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_FLEXIO_00_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_FLEXIO_00_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord H2), J128[3]/J52[13] */
/* Routed pin properties */
#define BOARD_INITPWM_FLEXIO_01_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_FLEXIO_01_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_FLEXIO_01_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_02 (coord K7), J128[5]/J52[11] */
/* Routed pin properties */
#define BOARD_INITPWM_FLEXIO_02_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_FLEXIO_02_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_FLEXIO_02_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_03 (coord E3), J128[7]/J52[9] */
/* Routed pin properties */
#define BOARD_INITPWM_FLEXIO_03_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_FLEXIO_03_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_FLEXIO_03_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_04 (coord L3), J128[9]/J52[7] */
/* Routed pin properties */
#define BOARD_INITPWM_FLEXIO_04_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_FLEXIO_04_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_FLEXIO_04_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_B1_05 (coord F2), J128[11]/J52[5] */
/* Routed pin properties */
#define BOARD_INITPWM_FLEXIO_05_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_FLEXIO_05_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_FLEXIO_05_CHANNEL                                       2U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);                     /* Function assigned for the Cortex-M7F */

/* GPIO_AD_12 (coord T24), J51[4]/J2[1] */
/* Routed pin properties */
#define BOARD_INITADC_CUR_A_ADC1_PERIPHERAL                               LPADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_A_ADC1_SIGNAL                                        A   /*!< Signal name */
#define BOARD_INITADC_CUR_A_ADC1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_12 (coord T24), J51[4]/J2[1] */
/* Routed pin properties */
#define BOARD_INITADC_CUR_A_ADC2_PERIPHERAL                               LPADC2   /*!< Peripheral name */
#define BOARD_INITADC_CUR_A_ADC2_SIGNAL                                        A   /*!< Signal name */
#define BOARD_INITADC_CUR_A_ADC2_CHANNEL                                      2U   /*!< Signal channel */

/* GPIO_AD_13 (coord U25), J51[2]/J2[3] */
/* Routed pin properties */
#define BOARD_INITADC_CUR_B_ADC1_PERIPHERAL                               LPADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_B_ADC1_SIGNAL                                        B   /*!< Signal name */
#define BOARD_INITADC_CUR_B_ADC1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_13 (coord U25), J51[2]/J2[3] */
/* Routed pin properties */
#define BOARD_INITADC_CUR_B_ADC2_PERIPHERAL                               LPADC2   /*!< Peripheral name */
#define BOARD_INITADC_CUR_B_ADC2_SIGNAL                                        B   /*!< Signal name */
#define BOARD_INITADC_CUR_B_ADC2_CHANNEL                                      2U   /*!< Signal channel */

/* GPIO_AD_06 (coord Y24), J51[8] */
/* Routed pin properties */
#define BOARD_INITADC_CUR_C_ADC1_PERIPHERAL                               LPADC1   /*!< Peripheral name */
#define BOARD_INITADC_CUR_C_ADC1_SIGNAL                                        A   /*!< Signal name */
#define BOARD_INITADC_CUR_C_ADC1_CHANNEL                                      1U   /*!< Signal channel */

/* GPIO_AD_07 (coord W23), J51[6] */
/* Routed pin properties */
#define BOARD_INITADC_VOLT_DCB_ADC1_PERIPHERAL                            LPADC1   /*!< Peripheral name */
#define BOARD_INITADC_VOLT_DCB_ADC1_SIGNAL                                     B   /*!< Signal name */
#define BOARD_INITADC_VOLT_DCB_ADC1_CHANNEL                                   1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);                     /* Function assigned for the Cortex-M7F */

/* GPIO_AD_27 (coord R23), U23[32] */
/* Routed pin properties */
#define BOARD_INITCMP_EXP_nIRQ_PERIPHERAL                                   CMP2   /*!< Peripheral name */
#define BOARD_INITCMP_EXP_nIRQ_SIGNAL                                         IN   /*!< Signal name */
#define BOARD_INITCMP_EXP_nIRQ_CHANNEL                                        4U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMP(void);                     /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_12 (coord B4), J128[10]/J52[3] */
/* Routed pin properties */
#define BOARD_INITENC_FLEXIO_12_PERIPHERAL                                  ENC1   /*!< Peripheral name */
#define BOARD_INITENC_FLEXIO_12_SIGNAL                                     PHASE   /*!< Signal name */
#define BOARD_INITENC_FLEXIO_12_CHANNEL                                        A   /*!< Signal channel */

/* GPIO_EMC_B1_13 (coord C1), J128[12]/J52[1] */
/* Routed pin properties */
#define BOARD_INITENC_FLEXIO_13_PERIPHERAL                                  ENC1   /*!< Peripheral name */
#define BOARD_INITENC_FLEXIO_13_SIGNAL                                     PHASE   /*!< Signal name */
#define BOARD_INITENC_FLEXIO_13_CHANNEL                                        B   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENC(void);                     /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
